Ran Apply for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...
Initializing modules...

Initializing provider plugins...
- Reusing previous version of hashicorp/random from the dependency lock file
- Using previously-installed hashicorp/random v3.5.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_integer.example[0] will be created
  + resource "random_integer" "example" {
      + id      = (known after apply)
      + keepers = {
          + "example" = "1"
        }
      + max     = 20000
      + min     = 1
      + result  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + example = (known after apply)
  + id      = ""
  + random  = (known after apply)
  + test    = (known after apply)
random_integer.example[0]: Creating...
random_integer.example[0]: Creation complete after 0s [id=14650]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

example = "1  14650"
id = ""
random = "14650"
test = "1  14650"
```

</details>